var handler = async (m, { conn, participants, groupMetadata, args, text }) => {

let img = 'https://pomf2.lain.la/f/7lfyrrvo.jpg'
const groupAdmins = participants.filter(p => p.admin)
const listaAdmins = groupAdmins.map((v, i) => ``).join('\n')
const owner = groupMetadata.owner || groupAdmins.find(p => p.admin === 'superadmin')?.id || m.chat.split`-`[0] + '@s.whatsapp.net'
if (!text) return m.reply(`🕓 𝗜𝗡𝗚𝗥𝗘𝗦𝗔 𝗨𝗡 𝗛𝗢𝗥𝗔𝗥𝗜𝗢.\n𝗘𝗷𝗲𝗺𝗽𝗹𝗼:\n.12vs12 4pm🇪🇨/3pm🇲🇽`)
if (text.length < 0) return m.reply(`⚙️ 𝗛𝗢𝗥𝗔𝗥𝗜𝗢 𝗠𝗔𝗟 𝗘𝗦𝗖𝗥𝗜𝗧𝗢, 𝗜𝗡𝗧𝗘𝗡𝗧𝗔 𝗗𝗘 𝗡𝗨𝗘𝗩𝗢.`)
let mensaje = args.join` `
let yo = `🕓 𝗛𝗢𝗥𝗔: *${text}*`
let texto = `╭──────⚔──────╮
          12 𝗩𝗘𝗥𝗦𝗨𝗦 12
╰──────⚔──────╯

${yo}
👕 𝗖𝗢𝗟𝗢𝗥: 

╭─────────────╮
│ 𝗘𝗦𝗖𝗨𝗔𝗗𝗥𝗔 1
│👑 ➤ 
│🥷🏻 ➤  
│🥷🏻 ➤ 
│🥷🏻 ➤ 
╰─────────────╯
╭─────────────╮
│ 𝗘𝗦𝗖𝗨𝗔𝗗𝗥𝗔 2
│👑 ➤ 
│🥷🏻 ➤  
│🥷🏻 ➤ 
│🥷🏻 ➤ 
╰─────────────╯
╭─────────────╮
│ 𝗘𝗦𝗖𝗨𝗔𝗗𝗥𝗔 3
│👑 ➤ 
│🥷🏻 ➤  
│🥷🏻 ➤ 
│🥷🏻 ➤ 
╰─────────────╯
╭─────────────╮
│ 𝗦𝗨𝗣𝗟𝗘𝗡𝗧𝗘𝗦 
│🥷🏻 ➤  
│🥷🏻 ➤
│🥷🏻 ➤
╰─────────────╯
𝗩𝗘𝗚𝗘𝗧𝗧𝗔 𝗕𝗢𝗧 
❙❘❙❙❘❙❚❙❘❙❙❚❙❘❙❘❙❚❙❘❙❙❚❙❘❙❙❘❙❚❙❘`.trim()
    await m.react('☠')
    await conn.sendFile(m.chat, img, 'thumbnail.jpg', text.trim(), fakegif3, null, fake)

}
handler.help = ['admins']
handler.tags = ['grupo']
handler.command = /^(12x12|12vs12)$/i
handler.group = true

export default handler
